{
  "metadata": {
    "experiment_name": "SealQA",
    "run_id": "run_SealQA_2025-12-18T02:41:05.742380",
    "timestamp": "2025-12-18T02:41:05.742380",
    "model_used": "google/gemini-3-flash-preview",
    "total_steps": 2698,
    "causal_steps": 67,
    "num_groups": 4,
    "skill_label_model": "google/gemini-3-flash-preview",
    "skill_label_cache_file": ".cache/skill_decomposition/skill_label_cache.json",
    "skill_grouping_model": "google/gemini-3-flash-preview",
    "skill_grouping_cache_file": ".cache/skill_decomposition/skill_grouping_cache.json",
    "max_context_steps": 5,
    "total_traces": 240,
    "passing_traces": 100,
    "failing_traces": 140
  },
  "skill_groups": [
    {
      "group_name": "Query Precision and Formulation",
      "group_description": "The ability to translate complex information needs into effective, specific, and well-structured search strings.",
      "rationale": "These labels all focus on the initial translation of a natural language question into a technical search query, emphasizing precision, structure, and the avoidance of overly broad terms.",
      "member_labels": [
        {
          "label": "search query optimization",
          "count": 12,
          "description": "The ability to formulate precise search queries that target specific data points required by a multi-part question. Failure occurs when a query is too broad or fails to include key constraints, such as the distinction between 'total sites' and 'cultural sites'."
        },
        {
          "label": "information retrieval strategy",
          "count": 8,
          "description": "The ability to formulate effective search queries that target specific record-breaking entities or historical data. Failure occurs when a query is too broad or lacks the specificity needed to disambiguate between similar categories or historical milestones."
        },
        {
          "label": "query formulation strategy",
          "count": 1,
          "description": "The ability to decompose a complex, multi-entity comparison into targeted search queries rather than inputting a long, natural language question that relies on the search engine to perform the intersection."
        },
        {
          "label": "query formulation precision",
          "count": 1,
          "description": "The ability to translate complex natural language constraints into effective search queries. Failure occurs when the agent conflates distinct criteria into a single search string, reducing the specificity of results."
        },
        {
          "label": "query formulation",
          "count": 1,
          "description": "The ability to translate a complex natural language information need into an effective search string. Failure occurs when the agent uses a literal or overly specific phrase that may limit search engine results compared to keyword-based or entity-focused queries."
        }
      ],
      "size": 23,
      "repair_success_count": 17,
      "repair_success_rate": 0.7391,
      "dominant_step_types": [
        [
          "tool_call",
          23
        ]
      ],
      "dominant_tools": [
        [
          "web_search",
          23
        ]
      ],
      "examples": [
        {
          "problem_id": "sealqa_0",
          "step_id": 0,
          "step_type": "tool_call",
          "tool_name": "web_search",
          "skill_label": "information retrieval strategy",
          "snippet": "",
          "is_causal": true
        },
        {
          "problem_id": "sealqa_15",
          "step_id": 0,
          "step_type": "tool_call",
          "tool_name": "web_search",
          "skill_label": "search query optimization",
          "snippet": "",
          "is_causal": true
        },
        {
          "problem_id": "sealqa_25",
          "step_id": 0,
          "step_type": "tool_call",
          "tool_name": "web_search",
          "skill_label": "information retrieval strategy",
          "snippet": "",
          "is_causal": true
        }
      ]
    },
    {
      "group_name": "Source Selection and Extraction Efficiency",
      "group_description": "The ability to identify authoritative sources and extract specific data points while avoiding redundant or high-volume, low-value actions.",
      "rationale": "This category focuses on the execution phase: choosing the right URL, parsing the content effectively, and maintaining state to avoid repeating work already completed.",
      "member_labels": [
        {
          "label": "source selection strategy",
          "count": 5,
          "description": "The ability to identify and navigate to the most granular or relevant data source based on initial search results. Failure occurs when an agent selects a broad overview page instead of a specialized sub-page (e.g., a list of episodes) that contains the specific structured data required."
        },
        {
          "label": "redundant search execution",
          "count": 2,
          "description": "The ability to recognize when sufficient information has already been retrieved and avoid unnecessary tool calls. This failure occurs when an agent repeats a search for data already present in the current context or previous tool outputs."
        },
        {
          "label": "unstructured data extraction",
          "count": 2,
          "description": "The ability to identify and retrieve specific data points from large, complex documents or PDFs. Failure occurs when an agent repeatedly attempts to fetch high-volume files without a strategy for parsing or locating the specific information within them."
        },
        {
          "label": "source relevance evaluation",
          "count": 1,
          "description": "The ability to assess whether a specific source or URL is likely to contain factual information about a general knowledge query versus technical or meta-data. Failure occurs when an agent attempts to extract primary facts from non-authoritative or unrelated technical documents."
        },
        {
          "label": "redundant information retrieval",
          "count": 1,
          "description": "The ability to recognize when sufficient information has already been gathered or when a new search query/URL will yield duplicate data. Failure occurs when the agent repeatedly accesses different sources for the same dataset instead of processing existing results."
        },
        {
          "label": "information extraction strategy",
          "count": 1,
          "description": "The ability to parse large documents for specific data points and pivot to more granular search queries when initial broad searches fail to yield structured comparisons. The failure involves repeating broad queries instead of extracting specific entities for targeted verification."
        },
        {
          "label": "redundant query generation",
          "count": 1,
          "description": "The ability to recognize when previous search results already contain the necessary information and to avoid generating repetitive queries that do not add new information."
        },
        {
          "label": "redundant tool execution",
          "count": 1,
          "description": "The ability to recognize when information has already been retrieved or is currently being processed, avoiding unnecessary repeat queries to the same or similar tools."
        }
      ],
      "size": 14,
      "repair_success_count": 9,
      "repair_success_rate": 0.6429,
      "dominant_step_types": [
        [
          "tool_call",
          14
        ]
      ],
      "dominant_tools": [
        [
          "web_fetch",
          9
        ],
        [
          "web_search",
          5
        ]
      ],
      "examples": [
        {
          "problem_id": "sealqa_25",
          "step_id": 2,
          "step_type": "tool_call",
          "tool_name": "web_fetch",
          "skill_label": "source selection strategy",
          "snippet": "",
          "is_causal": true
        },
        {
          "problem_id": "sealqa_25",
          "step_id": 5,
          "step_type": "tool_call",
          "tool_name": "web_search",
          "skill_label": "redundant search execution",
          "snippet": "",
          "is_causal": true
        },
        {
          "problem_id": "sealqa_69",
          "step_id": 6,
          "step_type": "tool_call",
          "tool_name": "web_fetch",
          "skill_label": "source relevance evaluation",
          "snippet": "",
          "is_causal": true
        }
      ]
    },
    {
      "group_name": "Iterative Search and Refinement",
      "group_description": "The ability to adapt search strategies based on previous results, including diversifying keywords and narrowing focus to fill specific data gaps.",
      "rationale": "This group covers the dynamic process of searching, where the agent must react to initial failures or incomplete data by pivoting, diversifying, or narrowing its search parameters.",
      "member_labels": [
        {
          "label": "Search query diversification",
          "count": 2,
          "description": "The ability to vary search parameters and keywords when initial attempts yield redundant or insufficient information. Failure occurs when the agent repeatedly uses similar queries that lead back to the same unhelpful source."
        },
        {
          "label": "targeted search refinement",
          "count": 2,
          "description": "The ability to narrow down a broad search by identifying specific missing entities or dates from previous results to verify a sequence. Failure occurs when the agent prematurely focuses on a specific candidate without sufficient comparative evidence."
        },
        {
          "label": "sequential information retrieval",
          "count": 1,
          "description": "The ability to systematically identify and access multiple distinct data sources required to satisfy a multi-part query. Failure occurs when an agent fails to iterate through all necessary sub-components of a set after identifying their existence."
        },
        {
          "label": "Hypothesis-driven search refinement",
          "count": 1,
          "description": "The ability to formulate specific search queries based on inferred missing information or potential candidates when general queries fail to yield updated results. Failure occurs when the agent prematurely narrows the search to a specific unverified entity without sufficient evidence."
        },
        {
          "label": "iterative query refinement",
          "count": 1,
          "description": "The ability to modify search parameters based on previous results to narrow down a specific chronological or ordinal fact. Failure occurs when the agent repeats similar queries without addressing the specific missing data point needed to complete a sequence."
        }
      ],
      "size": 7,
      "repair_success_count": 6,
      "repair_success_rate": 0.8571,
      "dominant_step_types": [
        [
          "tool_call",
          7
        ]
      ],
      "dominant_tools": [
        [
          "web_search",
          6
        ],
        [
          "web_fetch",
          1
        ]
      ],
      "examples": [
        {
          "problem_id": "sealqa_25",
          "step_id": 7,
          "step_type": "tool_call",
          "tool_name": "web_fetch",
          "skill_label": "sequential information retrieval",
          "snippet": "",
          "is_causal": true
        },
        {
          "problem_id": "sealqa_106",
          "step_id": 10,
          "step_type": "tool_call",
          "tool_name": "web_search",
          "skill_label": "Search query diversification",
          "snippet": "",
          "is_causal": true
        },
        {
          "problem_id": "sealqa_149",
          "step_id": 4,
          "step_type": "tool_call",
          "tool_name": "web_search",
          "skill_label": "Hypothesis-driven search refinement",
          "snippet": "",
          "is_causal": true
        }
      ]
    },
    {
      "group_name": "Temporal and Contextual Grounding",
      "group_description": "The ability to resolve time-based constraints and verify premises before executing searches to ensure chronological accuracy.",
      "rationale": "These skills relate to understanding the 'when' and 'if' of a query, ensuring that the agent is searching for the correct time period and not acting on false assumptions.",
      "member_labels": [
        {
          "label": "temporal query refinement",
          "count": 2,
          "description": "The ability to adjust search parameters based on the recency of the target information and the failure of previous broad searches. This failure occurs when an agent prematurely narrows a search to a specific future or current season before establishing a baseline of recent historical data."
        },
        {
          "label": "temporal grounding validation",
          "count": 1,
          "description": "The ability to verify the chronological relevance and existence of a resource before attempting access. This failure involves requesting data from a future date relative to the current real-world or simulation time."
        },
        {
          "label": "temporal constraint grounding",
          "count": 1,
          "description": "The ability to translate relative time references (e.g., 'last year') into absolute values based on the current execution context. Failure occurs when the agent uses literal phrasing instead of resolving the specific date required for accurate retrieval."
        },
        {
          "label": "temporal query optimization",
          "count": 1,
          "description": "The ability to formulate search queries that account for the most recent available data or specific timeframes. Failure occurs when an agent assumes a specific year for a 'most recent' event without verifying the current date or the actual latest occurrence of a recurring event."
        },
        {
          "label": "premise verification",
          "count": 1,
          "description": "The ability to verify the accuracy of an assumed relationship or event before using it as a search constraint. The failure involves hallucinating a specific successor or cause for a record change without evidence."
        }
      ],
      "size": 6,
      "repair_success_count": 5,
      "repair_success_rate": 0.8333,
      "dominant_step_types": [
        [
          "tool_call",
          6
        ]
      ],
      "dominant_tools": [
        [
          "web_search",
          5
        ],
        [
          "web_fetch",
          1
        ]
      ],
      "examples": [
        {
          "problem_id": "sealqa_5",
          "step_id": 4,
          "step_type": "tool_call",
          "tool_name": "web_fetch",
          "skill_label": "temporal grounding validation",
          "snippet": "",
          "is_causal": true
        },
        {
          "problem_id": "sealqa_16",
          "step_id": 0,
          "step_type": "tool_call",
          "tool_name": "web_search",
          "skill_label": "temporal constraint grounding",
          "snippet": "",
          "is_causal": true
        },
        {
          "problem_id": "sealqa_19",
          "step_id": 0,
          "step_type": "tool_call",
          "tool_name": "web_search",
          "skill_label": "temporal query optimization",
          "snippet": "",
          "is_causal": true
        }
      ]
    }
  ]
}